//package Console.GuessNumber;
//import java.util.Scanner;
//
//public class GuessNumber {
//// "Console game ""Guess number""
////Игра1:
////Пользователь загадывает число от 1 до 100, компьютер должен его угадать.
////Компьютер делает предположения, пользователь отвечает Больше либо Меньше.
////Когда компьютер угадывает - игра заканчивается.
//
//
//    программа відает случайное compNumber от 1 до 100
//
//    {
//        if (compNumber != userNumber)
//        {
//            Новій запрос в терминал и ввести больше или меньше
//        }
//            Метод SCANER (ввести больше или меньше чем compNumber)
//            Переменная (предел уменьшается, становится больше или меньше в зависимости от ответа(ввода пользователем))
//            if (compNumber > userNumber) {
//    }
//
//    else {
//        System.out.println("Write number, game ended");
//        }
//}
//
//
//
//

